/*
	Name: 
	Copyright: 
	Author: 
	Date: 19-08-18 21:15
	Description: 有4个学生，上地理课时提出我国四大谈水湖的排列次序如下：
甲：洞庭湖最大，洪泽湖最小，鄱阳湖第三；
乙：洪泽湖最大，洞庭湖最小，鄱阳湖第二，太湖第三；
丙：洪泽湖最小，洞庭湖第三；
丁：鄱阳湖最大，太湖最小，洪泽湖第二，洞庭湖第三；
对于各湖泊应处的位置，每个人只说对了一个。根据以上描述和条件，编写程序，让计算机判断一下各湖泊应该处于第几位。
编程分别用H，D，P，T代表洪泽湖，洞庭湖，鄱阳湖，太湖四大湖， 用A1，B1，C1，D1代表甲，乙，丙，丁四人所说的话，
*/

#include<iostream>
#include<cstdio>

using namespace std;

int main()
{

    int H,D,P,T;
    int A1,B1,C1,D1;
    
    for(H=1;H<=4;H++)
      for(D=1;D<=4;D++)
        for(P=1;P<=4;P++)
          for(T=1;T<=4;T++)
            {
                A1 = ((D==1)+(H==4)+(P==3)) == 1;
                B1 = ((H==1)+(D==4)+(P==2)+(T==3)) == 1;
                C1 = ((D==3)+(H==4)) == 1;
                D1 = ((P==1)+(T==4)+(H==2)+(D==3)) == 1;
                
                if(H!=D&&H!=P&&H!=T && D!=P&&D!=T && P!=T && A1&&B1&&C1&&D1)
                {
                    printf("H=%d,D=%d,P=%d,T=%d\n",H,D,P,T);
                }    

            }
     
      return 0;               
}          
